digital_twin_dynamic/estimators/predictor_default_latency/qwen-2.5-7b-instruct/output/_800__1_200/log_21692928.out
INFO 05-29 16:44:23 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='openai', base_url=None, host='localhost', port=63329, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path=None, model='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/qwen/qwen-2.5-7b-instruct', tokenizer=None, num_prompts=8192, sharegpt_output_len=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, request_rate=inf, request_rate_by_lora=None, seed=0, trust_remote_code=False, disable_tqdm=True, save_result=True, metadata=None, result_dir='digital_twin_dynamic/estimators/predictor_default_latency/qwen-2.5-7b-instruct/output/_800__1_200', launch_server=True, server_args='--port=63329 --disable-log-requests --model="/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/qwen/qwen-2.5-7b-instruct" --scheduler-cls="vllm.v1.core.sched.scheduler.Scheduler" --no-enable-prefix-caching --max-num-seqs=800', server_init_time=300, disable_log_stats=False, disable_loras_users=True, user_lora_request_relation=None, restrict_loras=None, lora_pre_loading=False, use_synthetic_dataset='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/data/common_american_words.txt', synthetic_input_length=1, synthetic_output_length=200)
All available words: 63366
Generated prompt with 4 input length: Swoon.
Server started
Starting initial single prompt test run for base model
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     8192      
Benchmark duration (s):                  104.99    
Total input tokens:                      32768     
Total generated tokens:                  1638400   
Request throughput (req/s):              78.03     
Input token throughput (tok/s):          312.12    
Output token throughput (tok/s):         15605.82  
---------------Time to First Token----------------
Mean TTFT (ms):                          49936.87  
Median TTFT (ms):                        52881.72  
P99 TTFT (ms):                           97861.36  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          44.71     
Median TPOT (ms):                        45.32     
P99 TPOT (ms):                           47.16     
---------------Inter-token Latency----------------
Mean ITL (ms):                           44.71     
Median ITL (ms):                         44.71     
P99 ITL (ms):                            65.89     
==================================================
Concurrent checker terminated
Server terminated